Repository: thomas-domville/AppleVis
Catalog: AppleVis/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, el, es, fa, fr, he, hi, id, it, ja, ko, nl, pl, pt, ru, sv, th, tr, uk, vi, zh_hans

source: The only place that explained what I Don't Agree actually does was spoken by VoiceOver, not shown on screen — anyone reading the screen visually saw two buttons with no stated consequence for the second one. It now says so in plain text too: declining is fine, AppleVis stays fully browsable without signing in, and we'll ask again the next time you try to sign in. Discussed directly.
ar: المكان الوحيد الذي كان يشرح ما يفعله زر لا أوافق فعليًا كان أمرًا ينطقه VoiceOver فقط، دون أن يظهر على الشاشة — وأي شخص يقرأ الشاشة بصريًا كان يرى زرين دون توضيح لعاقبة الزر الثاني. الآن يُذكر ذلك في نص عادي أيضًا: الرفض أمر لا بأس به، ويظل بإمكانك تصفح AppleVis بالكامل دون تسجيل الدخول، وسنسألك مرة أخرى في المرة القادمة التي تحاول فيها تسجيل الدخول. نوقش مباشرة.
de: Der einzige Ort, der erklärte, was Ich stimme nicht zu tatsächlich bewirkt, wurde nur von VoiceOver vorgelesen, nicht auf dem Bildschirm angezeigt — wer den Bildschirm visuell las, sah nur zwei Schaltflächen ohne genannte Konsequenz für die zweite. Jetzt steht das auch als normaler Text da: Ablehnen ist völlig in Ordnung, AppleVis bleibt vollständig durchsuchbar, ohne dass du dich anmeldest, und wir fragen erneut, sobald du dich das nächste Mal anmelden möchtest. Direkt besprochen.
el: Το μόνο σημείο που εξηγούσε τι κάνει πραγματικά το Δεν Συμφωνώ το εκφωνούσε μόνο το VoiceOver, χωρίς να εμφανίζεται στην οθόνη — όποιος διάβαζε την οθόνη οπτικά έβλεπε δύο κουμπιά χωρίς δηλωμένη συνέπεια για το δεύτερο. Τώρα αναφέρεται και σε απλό κείμενο: η άρνηση είναι εντάξει, το AppleVis παραμένει πλήρως προσβάσιμο για περιήγηση χωρίς σύνδεση, και θα σας ρωτήσουμε ξανά την επόμενη φορά που θα προσπαθήσετε να συνδεθείτε. Συζητήθηκε απευθείας.
es: El único lugar que explicaba lo que realmente hace No estoy de acuerdo lo decía solo VoiceOver, sin mostrarse en pantalla — cualquiera que leyera la pantalla visualmente veía dos botones sin ninguna consecuencia indicada para el segundo. Ahora también lo dice en texto normal: rechazar está bien, AppleVis sigue siendo totalmente explorable sin iniciar sesión, y te lo volveremos a preguntar la próxima vez que intentes iniciar sesión. Debatido directamente.
fa: تنها جایی که توضیح می‌داد دکمهٔ موافق نیستم واقعاً چه می‌کند، فقط توسط VoiceOver خوانده می‌شد و روی صفحه نشان داده نمی‌شد — هر کسی که صفحه را به‌صورت بصری می‌خواند، دو دکمه بدون هیچ پیامد مشخصی برای دکمهٔ دوم می‌دید. اکنون این موضوع در متن ساده نیز بیان شده است: رد کردن اشکالی ندارد، AppleVis همچنان بدون ورود کاملاً قابل مرور است، و دفعهٔ بعد که بخواهید وارد شوید، دوباره از شما می‌پرسیم. مستقیماً بحث شد.
fr: Le seul endroit qui expliquait ce que fait réellement Je n'accepte pas n'était prononcé que par VoiceOver, sans rien afficher à l'écran — quiconque lisait l'écran visuellement voyait deux boutons sans conséquence indiquée pour le second. C'est désormais indiqué aussi en texte normal : refuser ne pose aucun problème, AppleVis reste entièrement consultable sans connexion, et nous vous le redemanderons la prochaine fois que vous essaierez de vous connecter. Discuté directement.
he: המקום היחיד שהסביר מה בדיוק עושה אינני מסכים/ה היה מוקרא על ידי VoiceOver בלבד, בלי שיוצג על המסך — מי שקרא את המסך חזותית ראה שני כפתורים בלי שום השלכה מצוינת עבור השני. עכשיו זה כתוב גם בטקסט רגיל: אפשר בהחלט לסרב, AppleVis נשאר ניתן לגלישה מלאה בלי להתחבר, ונשאל שוב בפעם הבאה שתנסה/י להתחבר. נדון ישירות.
hi: मैं सहमत नहीं हूं वास्तव में क्या करता है, यह बताने वाली एकमात्र जगह वह थी जिसे केवल VoiceOver बोलता था, स्क्रीन पर दिखाई नहीं देती थी — जो कोई भी स्क्रीन को देखकर पढ़ता था, उसे दूसरे बटन के लिए बिना बताए परिणाम वाले दो बटन दिखते थे। अब यह सामान्य टेक्स्ट में भी कहा जाता है: अस्वीकार करना ठीक है, AppleVis साइन इन किए बिना भी पूरी तरह ब्राउज़ करने योग्य बना रहता है, और अगली बार जब आप साइन इन करने की कोशिश करेंगे, तो हम फिर से पूछेंगे। सीधे चर्चा की गई।
id: Satu-satunya tempat yang menjelaskan apa yang sebenarnya dilakukan Saya Tidak Setuju hanya diucapkan oleh VoiceOver, tidak ditampilkan di layar — siapa pun yang membaca layar secara visual hanya melihat dua tombol tanpa konsekuensi yang dinyatakan untuk tombol kedua. Sekarang hal itu juga tertulis dalam teks biasa: menolak tidak masalah, AppleVis tetap dapat dijelajahi sepenuhnya tanpa masuk, dan kami akan menanyakannya lagi lain kali Anda mencoba masuk. Dibahas secara langsung.
it: L'unico punto che spiegava cosa fa realmente Non accetto veniva solo pronunciato da VoiceOver, senza comparire a schermo — chiunque leggesse la schermata visivamente vedeva due pulsanti senza alcuna conseguenza indicata per il secondo. Ora è indicato anche in testo normale: rifiutare va benissimo, AppleVis resta completamente esplorabile senza accedere, e te lo richiederemo di nuovo la prossima volta che proverai ad accedere. Discusso direttamente.
ja: 同意しないが実際に何をするのかを説明していたのは、VoiceOverが読み上げるだけで画面には表示されていませんでした——画面を目で読んだ人には、2つ目のボタンの結果が示されないまま、2つのボタンが見えるだけでした。今ではこれが通常のテキストにも記載されるようになりました。同意しなくても問題はなく、AppleVisはサインインしなくても引き続き自由に閲覧でき、次にサインインしようとしたときに改めて確認します。直接話し合いました。
ko: 동의하지 않음이 실제로 어떤 동작을 하는지 설명하는 부분은 VoiceOver로만 들을 수 있고 화면에는 표시되지 않았습니다 — 화면을 시각적으로 읽는 사람에게는 두 번째 버튼에 대한 결과 설명 없이 두 개의 버튼만 보였습니다. 이제는 일반 텍스트로도 이를 안내합니다: 거부해도 괜찮으며, AppleVis는 로그인하지 않아도 계속 자유롭게 둘러볼 수 있고, 다음에 로그인을 시도할 때 다시 물어봅니다. 직접 논의했습니다.
nl: De enige plek die uitlegde wat Ik ga niet akkoord daadwerkelijk doet, werd alleen door VoiceOver uitgesproken en niet op het scherm getoond — wie het scherm visueel las, zag twee knoppen zonder aangegeven gevolg voor de tweede. Dit staat nu ook in gewone tekst: weigeren is prima, AppleVis blijft volledig doorbladerbaar zonder in te loggen, en we vragen het opnieuw de volgende keer dat je probeert in te loggen. Rechtstreeks besproken.
pl: Jedynym miejscem wyjaśniającym, co faktycznie robi Nie zgadzam się, była wypowiedź wyłącznie VoiceOver, bez pokazania na ekranie — każdy, kto czytał ekran wzrokowo, widział dwa przyciski bez podanej konsekwencji dla drugiego z nich. Teraz mówi o tym również zwykły tekst: odmowa jest w porządku, AppleVis pozostaje w pełni dostępny do przeglądania bez logowania, a zapytamy ponownie następnym razem, gdy spróbujesz się zalogować. Omówione bezpośrednio.
pt: O único lugar que explicava o que Não concordo realmente faz era falado apenas pelo VoiceOver, sem aparecer na tela — quem lia a tela visualmente via apenas dois botões sem nenhuma consequência indicada para o segundo. Agora isso também é dito em texto simples: recusar não tem problema, a AppleVis continua totalmente navegável sem fazer login, e perguntaremos novamente na próxima vez que você tentar fazer login. Discutido diretamente.
ru: Единственным местом, объяснявшим, что на самом деле делает кнопка Не согласен, было то, что произносил только VoiceOver, без отображения на экране — тот, кто читал экран визуально, видел лишь две кнопки без указанных последствий для второй. Теперь это также указано обычным текстом: отказаться совершенно нормально, AppleVis остаётся полностью доступным для просмотра без входа, и мы спросим снова, когда вы в следующий раз попытаетесь войти. Обсуждено напрямую.
sv: Den enda platsen som förklarade vad Jag godkänner inte faktiskt gör lästes bara upp av VoiceOver och visades inte på skärmen — den som läste skärmen visuellt såg bara två knappar utan någon angiven konsekvens för den andra. Nu står det även i vanlig text: det är helt okej att tacka nej, AppleVis förblir fullt utforskningsbart utan att logga in, och vi frågar igen nästa gång du försöker logga in. Diskuterat direkt.
th: จุดเดียวที่อธิบายว่าฉันไม่ยอมรับทำอะไรจริง ๆ นั้น VoiceOver จะพูดให้ฟังเท่านั้น ไม่ได้แสดงบนหน้าจอ — ใครก็ตามที่อ่านหน้าจอด้วยสายตาจะเห็นเพียงสองปุ่มโดยไม่มีการระบุผลลัพธ์ของปุ่มที่สอง ตอนนี้มีการระบุไว้เป็นข้อความปกติด้วยเช่นกัน: การปฏิเสธไม่เป็นไร AppleVis ยังคงท่องดูได้อย่างเต็มที่โดยไม่ต้องลงชื่อเข้าใช้ และเราจะถามอีกครั้งในครั้งถัดไปที่คุณพยายามลงชื่อเข้าใช้ พูดคุยกันโดยตรง
tr: Kabul Etmiyorum'un gerçekte ne yaptığını açıklayan tek yeri yalnızca VoiceOver seslendiriyordu, ekranda gösterilmiyordu — ekranı görsel olarak okuyan biri, ikinci düğme için belirtilen hiçbir sonuç olmadan yalnızca iki düğme görüyordu. Artık bu, düz metinde de belirtiliyor: reddetmek sorun değil, AppleVis oturum açmadan tamamen gezilebilir kalır ve bir sonraki oturum açma denemenizde tekrar soracağız. Doğrudan tartışıldı.
uk: Єдиним місцем, яке пояснювало, що насправді робить кнопка Не погоджуюсь, було те, що озвучував лише VoiceOver, без показу на екрані — той, хто читав екран візуально, бачив лише дві кнопки без зазначеного наслідку для другої. Тепер це також зазначено звичайним текстом: відмовитися — це нормально, AppleVis залишається повністю доступним для перегляду без входу, і ми запитаємо знову наступного разу, коли ви спробуєте увійти. Обговорено напряму.
vi: Nơi duy nhất giải thích Tôi không đồng ý thực sự làm gì chỉ được VoiceOver đọc lên, không hiển thị trên màn hình — bất kỳ ai đọc màn hình bằng mắt đều chỉ thấy hai nút mà không có hậu quả nào được nêu cho nút thứ hai. Giờ đây điều này cũng được nêu bằng văn bản thông thường: từ chối cũng không sao, AppleVis vẫn có thể duyệt xem toàn bộ mà không cần đăng nhập, và chúng tôi sẽ hỏi lại vào lần tới khi bạn cố đăng nhập. Đã thảo luận trực tiếp.
zh_hans: 唯一说明我不同意实际会怎样的地方，只有旁白会读出来，屏幕上并不会显示——用视觉方式阅读屏幕的人看到的只是两个按钮，却没有说明第二个按钮会带来什么后果。现在普通文字中也说明了这一点：拒绝也没关系，不登录时你仍然可以完整浏览 AppleVis，等你下次尝试登录时，我们会再次询问。经直接讨论。

source: Reinstalling AppleVis while signed in — or setting up a new device on the same account — correctly remembered your read history, but forgot when you'd first started using the app. Without that, nearly everything in the feed that hadn't been individually opened before showed up as new all at once, whether it was actually posted yesterday or months ago. Fixed so that's remembered too. Reported directly.
ar: إعادة تثبيت AppleVis وأنت مسجّل الدخول — أو إعداد جهاز جديد بنفس الحساب — كانت تتذكر سجل قراءتك بشكل صحيح، لكنها كانت تنسى متى بدأت استخدام التطبيق لأول مرة. دون ذلك، كان كل ما يقارب محتوى الخلاصة الذي لم يُفتح فرديًا من قبل يظهر كجديد دفعة واحدة، سواء نُشر بالأمس فعليًا أو منذ أشهر. تم الإصلاح ليتذكر ذلك أيضًا. أُبلغ عنه مباشرة.
de: Eine Neuinstallation von AppleVis im angemeldeten Zustand — oder das Einrichten eines neuen Geräts mit demselben Konto — merkte sich deinen Leseverlauf korrekt, vergaß aber, wann du die App zum ersten Mal genutzt hast. Ohne das erschien fast alles im Feed, das nicht einzeln geöffnet worden war, schlagartig als neu, egal ob es tatsächlich gestern oder vor Monaten veröffentlicht wurde. Behoben, sodass auch das jetzt gemerkt wird. Direkt gemeldet.
el: Η επανεγκατάσταση του AppleVis ενώ είστε συνδεδεμένοι — ή η ρύθμιση μιας νέας συσκευής στον ίδιο λογαριασμό — θυμόταν σωστά το ιστορικό ανάγνωσής σας, αλλά ξεχνούσε πότε ξεκινήσατε να χρησιμοποιείτε την εφαρμογή για πρώτη φορά. Χωρίς αυτό, σχεδόν οτιδήποτε στη ροή που δεν είχε ανοιχτεί ξεχωριστά εμφανιζόταν ως νέο όλο μαζί, είτε είχε πράγματι δημοσιευτεί χθες είτε πριν από μήνες. Διορθώθηκε ώστε να θυμάται και αυτό. Αναφέρθηκε απευθείας.
es: Reinstalar AppleVis mientras habías iniciado sesión — o configurar un nuevo dispositivo con la misma cuenta — recordaba correctamente tu historial de lectura, pero olvidaba cuándo habías empezado a usar la app por primera vez. Sin eso, casi todo en el feed que no se había abierto individualmente antes aparecía como nuevo de golpe, sin importar si en realidad se había publicado ayer o hacía meses. Solucionado para que eso también se recuerde. Reportado directamente.
fa: نصب مجدد AppleVis در حالی که وارد حساب کاربری بودید — یا راه‌اندازی یک دستگاه جدید با همان حساب — تاریخچهٔ خواندن شما را به‌درستی به خاطر می‌سپرد، اما فراموش می‌کرد چه زمانی برای اولین بار از برنامه استفاده کرده‌اید. بدون آن، تقریباً هر چیزی در فید که پیش‌تر به‌طور جداگانه باز نشده بود، یکجا به‌عنوان جدید نمایش داده می‌شد، چه واقعاً دیروز منتشر شده باشد و چه ماه‌ها پیش. برطرف شد تا این مورد نیز به خاطر سپرده شود. مستقیماً گزارش شد.
fr: Réinstaller AppleVis en étant connecté — ou configurer un nouvel appareil avec le même compte — mémorisait correctement votre historique de lecture, mais oubliait la date à laquelle vous avez commencé à utiliser l'appli pour la première fois. Sans cela, presque tout ce qui, dans le flux, n'avait pas été ouvert individuellement apparaissait comme nouveau d'un coup, que ce soit réellement publié la veille ou des mois plus tôt. Corrigé pour que cela soit aussi mémorisé. Signalé directement.
he: התקנה מחדש של AppleVis כשהיית מחובר/ת — או הגדרת מכשיר חדש באותו חשבון — זכרה כראוי את היסטוריית הקריאה שלך, אבל שכחה מתי התחלת להשתמש באפליקציה בפעם הראשונה. בלי זה, כמעט כל מה שבפיד שלא נפתח בנפרד קודם לכן הופיע כחדש בבת אחת, בין אם פורסם באמת אתמול ובין אם לפני חודשים. תוקן כך שגם זה נזכר. דווח ישירות.
hi: साइन इन रहते हुए AppleVis को दोबारा इंस्टॉल करना — या उसी खाते पर नया डिवाइस सेट करना — आपकी रीड हिस्ट्री को सही तरीके से याद रखता था, लेकिन यह भूल जाता था कि आपने ऐप का उपयोग पहली बार कब शुरू किया था। इसके बिना, फ़ीड में लगभग हर वह चीज़ जो पहले अलग से नहीं खोली गई थी, एक साथ नई दिखाई देने लगती थी, चाहे वह वास्तव में कल पोस्ट की गई हो या महीनों पहले। अब ठीक कर दिया गया है ताकि यह भी याद रखा जाए। सीधे रिपोर्ट किया गया।
id: Menginstal ulang AppleVis saat masuk — atau menyiapkan perangkat baru dengan akun yang sama — dengan benar mengingat riwayat baca Anda, tetapi lupa kapan Anda pertama kali mulai menggunakan aplikasi. Tanpa itu, hampir semua yang ada di feed yang belum pernah dibuka satu per satu sebelumnya langsung muncul sebagai baru sekaligus, baik itu benar-benar diposting kemarin atau berbulan-bulan lalu. Diperbaiki agar hal itu juga diingat. Dilaporkan secara langsung.
it: Reinstallare AppleVis da account connesso — o configurare un nuovo dispositivo con lo stesso account — ricordava correttamente la cronologia di lettura, ma dimenticava quando avevi iniziato a usare l'app per la prima volta. Senza questo, quasi tutto nel feed che non era stato aperto singolarmente in precedenza compariva come nuovo tutto insieme, sia che fosse stato pubblicato davvero ieri o mesi prima. Risolto in modo che anche questo venga ricordato. Segnalato direttamente.
ja: サインインした状態でAppleVisを再インストールしたとき、または同じアカウントで新しいデバイスをセットアップしたときに、読書履歴は正しく記憶されていましたが、アプリを初めて使い始めた時点は忘れられていました。これにより、これまで個別に開いたことのないフィード内のほぼすべての項目が、実際には昨日投稿されたものでも何か月も前のものでも関係なく、一斉に「新着」として表示されていました。その時点も記憶されるように修正しました。直接報告いただきました。
ko: 로그인한 상태에서 AppleVis를 재설치하거나, 같은 계정으로 새 기기를 설정하면 읽기 기록은 올바르게 기억되었지만, 앱을 처음 사용하기 시작한 시점은 잊혀졌습니다. 그 결과 이전에 개별적으로 열어본 적이 없는 피드의 거의 모든 항목이, 실제로 어제 게시되었든 몇 달 전에 게시되었든 관계없이 한꺼번에 새 항목으로 표시되었습니다. 이제 그 시점도 함께 기억하도록 수정했습니다. 직접 신고되었습니다.
nl: AppleVis opnieuw installeren terwijl je was ingelogd — of een nieuw apparaat instellen met hetzelfde account — onthield je leesgeschiedenis correct, maar vergat wanneer je de app voor het eerst was gaan gebruiken. Zonder dat verscheen bijna alles in de feed dat nog niet afzonderlijk was geopend, in één keer als nieuw, of het nu echt gisteren was geplaatst of maanden geleden. Opgelost zodat dit nu ook wordt onthouden. Rechtstreeks gemeld.
pl: Ponowna instalacja AppleVis podczas zalogowania — lub konfigurowanie nowego urządzenia na tym samym koncie — poprawnie zapamiętywała historię czytania, ale zapominała, kiedy pierwszy raz zacząłeś korzystać z aplikacji. Bez tego niemal wszystko w kanale, co nie zostało wcześniej otwarte indywidualnie, pojawiało się od razu jako nowe, niezależnie od tego, czy zostało faktycznie opublikowane wczoraj, czy miesiące temu. Naprawione tak, aby to również było zapamiętywane. Zgłoszone bezpośrednio.
pt: Reinstalar a AppleVis enquanto conectado — ou configurar um novo dispositivo na mesma conta — lembrava corretamente seu histórico de leitura, mas esquecia quando você começou a usar o app pela primeira vez. Sem isso, quase tudo no feed que não havia sido aberto individualmente antes aparecia como novo de uma só vez, tendo sido publicado ontem mesmo ou meses atrás. Corrigido para que isso também seja lembrado. Reportado diretamente.
ru: Переустановка AppleVis в состоянии входа в систему — или настройка нового устройства с той же учётной записью — правильно запоминала историю чтения, но забывала, когда вы впервые начали пользоваться приложением. Без этого почти всё в ленте, что раньше не открывалось по отдельности, сразу же отображалось как новое, независимо от того, было ли это опубликовано вчера или месяцы назад. Исправлено так, чтобы это тоже запоминалось. Сообщено напрямую.
sv: Att installera om AppleVis medan du var inloggad — eller att konfigurera en ny enhet på samma konto — kom korrekt ihåg din läshistorik, men glömde när du först började använda appen. Utan det dök nästan allt i flödet som inte tidigare öppnats individuellt upp som nytt på en gång, oavsett om det faktiskt publicerades igår eller för månader sedan. Åtgärdat så att även detta nu kommas ihåg. Rapporterat direkt.
th: การติดตั้ง AppleVis ใหม่ขณะที่ลงชื่อเข้าใช้อยู่ — หรือการตั้งค่าอุปกรณ์ใหม่ด้วยบัญชีเดียวกัน — จดจำประวัติการอ่านของคุณได้อย่างถูกต้อง แต่กลับลืมว่าคุณเริ่มใช้แอปครั้งแรกเมื่อใด หากไม่มีสิ่งนี้ เกือบทุกอย่างในฟีดที่ไม่เคยถูกเปิดทีละรายการมาก่อนจะปรากฏเป็นรายการใหม่พร้อมกันทั้งหมด ไม่ว่าจะโพสต์จริงเมื่อวานหรือหลายเดือนก่อนก็ตาม แก้ไขแล้วให้จดจำสิ่งนี้ด้วย รายงานโดยตรง
tr: Oturum açıkken AppleVis'i yeniden yüklemek — veya aynı hesapla yeni bir cihaz kurmak — okuma geçmişinizi doğru şekilde hatırlıyordu, ancak uygulamayı ilk ne zaman kullanmaya başladığınızı unutuyordu. Bu olmadan, akışta daha önce tek tek açılmamış hemen hemen her şey, gerçekten dün mü yoksa aylar önce mi yayınlandığına bakılmaksızın hepsi birden yeni olarak görünüyordu. Bu da hatırlanacak şekilde düzeltildi. Doğrudan bildirildi.
uk: Перевстановлення AppleVis у стані входу в систему — або налаштування нового пристрою з тим самим обліковим записом — правильно запам'ятовувало вашу історію читання, але забувало, коли ви вперше почали користуватися додатком. Без цього майже все у стрічці, що раніше не відкривалося окремо, з'являлося як нове одразу, незалежно від того, чи було це справді опубліковано вчора, чи місяці тому. Виправлено так, щоб це теж запам'ятовувалося. Повідомлено напряму.
vi: Cài đặt lại AppleVis trong khi đã đăng nhập — hoặc thiết lập một thiết bị mới trên cùng tài khoản — ghi nhớ đúng lịch sử đọc của bạn, nhưng lại quên mất thời điểm bạn bắt đầu sử dụng ứng dụng lần đầu tiên. Nếu thiếu điều đó, gần như mọi thứ trong nguồn cấp dữ liệu chưa từng được mở riêng lẻ trước đó đều xuất hiện là mới cùng một lúc, bất kể nó thực sự được đăng hôm qua hay nhiều tháng trước. Đã khắc phục để điều đó cũng được ghi nhớ. Đã được báo cáo trực tiếp.
zh_hans: 在已登录的情况下重新安装 AppleVis——或者在同一账户下设置新设备——会正确记住你的阅读记录，却会忘记你最初开始使用该应用的时间。少了这一点，几乎所有此前未曾单独打开过的动态内容，都会一下子全部显示为新内容，无论它实际上是昨天发布的还是几个月前发布的。现已修复，让这一点也一并被记住。经直接报告。
